# Converting Raw Data to Clean Data

In [1]:
str="Jyosthana Kadiyam"

In [2]:
str

'Jyosthana Kadiyam'

In [6]:
s=str.split() #sring splits into list of pbjects
s

['Jyosthana', 'Kadiyam']

In [7]:
import numpy as np
arr=np.array([[1,2,3],[4,5,6]])
arr

array([[1, 2, 3],
       [4, 5, 6]])

In [8]:
np.split(arr,2)

[array([[1, 2, 3]]), array([[4, 5, 6]])]

In [9]:
address="660 1stAve NewYork 10016"
address

'660 1stAve NewYork 10016'

In [10]:
addr=address.split()
addr

['660', '1stAve', 'NewYork', '10016']

In [11]:
col=['house no.','street','state','zipcode']
dict1=dict(zip(col,addr))
dict1

{'house no.': '660',
 'street': '1stAve',
 'state': 'NewYork',
 'zipcode': '10016'}

In [13]:
import pandas as pd
df=pd.read_csv(r'/Users/jyosthanakadiyam/Desktop/Full Stack DS/Oct 2023/3rd/rawdata.csv')
df

,Unnamed: 0,Unnamed: 1,Address,Dt,Name,Time
0,0,Nan,"45 rd, kenith street, btm, bangalore ,500038",4/3/22,abc,8:30:21
1,1,Nan,"45 rd, street, hitech, Hd ,500038",4/22/22,dec,5:30:21

In [15]:
df.dropna(axis=1,inplace=True) #removes NaN columns
df

,Unnamed: 0,Unnamed: 1,Address,Dt,Name,Time
0,0,Nan,"45 rd, kenith street, btm, bangalore ,500038",4/3/22,abc,8:30:21
1,1,Nan,"45 rd, street, hitech, Hd ,500038",4/22/22,dec,5:30:21

In [18]:
df[['house no.','street','city','state','zipcode']]=df['Address'].str.split(',',expand=True)
df

,Unnamed: 0,Unnamed: 1,Address,Dt,Name,Time,house no.,street,city,state,zipcode
0,0,Nan,"45 rd, kenith street, btm, bangalore ,500038",4/3/22,abc,8:30:21,45 rd,kenith street,btm,bangalore,500038
1,1,Nan,"45 rd, street, hitech, Hd ,500038",4/22/22,dec,5:30:21,45 rd,street,hitech,Hd,500038

In [19]:
df[['month','date','year']]=df['Dt'].str.split("/",expand=True)
df

,Unnamed: 0,Unnamed: 1,Address,Dt,Name,Time,house no.,street,city,state,zipcode,month,date,year
0,0,Nan,"45 rd, kenith street, btm, bangalore ,500038",4/3/22,abc,8:30:21,45 rd,kenith street,btm,bangalore,500038,4,3,22
1,1,Nan,"45 rd, street, hitech, Hd ,500038",4/22/22,dec,5:30:21,45 rd,street,hitech,Hd,500038,4,22,22

In [23]:
df

,Unnamed: 0,Unnamed: 1,Address,Name,Time,house no.,street,city,state,zipcode,month,date,year
0,0,Nan,"45 rd, kenith street, btm, bangalore ,500038",abc,8:30:21,45 rd,kenith street,btm,bangalore,500038,4,3,22
1,1,Nan,"45 rd, street, hitech, Hd ,500038",dec,5:30:21,45 rd,street,hitech,Hd,500038,4,22,22

In [24]:
df=df.drop("Address",axis=1)
df

,Unnamed: 0,Unnamed: 1,Name,Time,house no.,street,city,state,zipcode,month,date,year
0,0,Nan,abc,8:30:21,45 rd,kenith street,btm,bangalore,500038,4,3,22
1,1,Nan,dec,5:30:21,45 rd,street,hitech,Hd,500038,4,22,22

In [26]:
df[["hrs","min","sec"]]=df["Time"].str.split(":",expand=True)
df

,Unnamed: 0,Unnamed: 1,Name,Time,house no.,street,city,state,zipcode,month,date,year,hrs,min,sec
0,0,Nan,abc,8:30:21,45 rd,kenith street,btm,bangalore,500038,4,3,22,8,30,21
1,1,Nan,dec,5:30:21,45 rd,street,hitech,Hd,500038,4,22,22,5,30,21

In [27]:
df=df.drop("Time",axis=1)
df

,Unnamed: 0,Unnamed: 1,Name,house no.,street,city,state,zipcode,month,date,year,hrs,min,sec
0,0,Nan,abc,45 rd,kenith street,btm,bangalore,500038,4,3,22,8,30,21
1,1,Nan,dec,45 rd,street,hitech,Hd,500038,4,22,22,5,30,21